/*
 * head file for Ingenic Semiconductor's JZ4740 CPU.
 */
#ifndef __JZ4740_H__
#define __JZ4740_H__

#include <asm/addrspace.h>
#include <asm/cacheops.h>

/* Boot ROM Specification  */
/* NOR Boot config */
#define JZ4740_NORBOOT_8BIT	0x00000000	/* 8-bit data bus flash */
#define JZ4740_NORBOOT_16BIT	0x10101010	/* 16-bit data bus flash */
#define JZ4740_NORBOOT_32BIT	0x20202020	/* 32-bit data bus flash */
/* NAND Boot config */
#define JZ4740_NANDBOOT_B8R3	0xffffffff	/* 8-bit bus & 3 row cycles */
#define JZ4740_NANDBOOT_B8R2	0xf0f0f0f0	/* 8-bit bus & 2 row cycles */
#define JZ4740_NANDBOOT_B16R3	0x0f0f0f0f	/* 16-bit bus & 3 row cycles */
#define JZ4740_NANDBOOT_B16R2	0x00000000	/* 16-bit bus & 2 row cycles */

/* 1st-level interrupts */
#define JZ4740_IRQ_I2C		1
#define JZ4740_IRQ_UHC		3
#define JZ4740_IRQ_UART0	9
#define JZ4740_IRQ_SADC		12
#define JZ4740_IRQ_MSC		14
#define JZ4740_IRQ_RTC		15
#define JZ4740_IRQ_SSI		16
#define JZ4740_IRQ_CIM		17
#define JZ4740_IRQ_AIC		18
#define JZ4740_IRQ_ETH		19
#define JZ4740_IRQ_DMAC		20
#define JZ4740_IRQ_TCU2		21
#define JZ4740_IRQ_TCU1		22
#define JZ4740_IRQ_TCU0		23
#define JZ4740_IRQ_UDC		24
#define JZ4740_IRQ_GPIO3	25
#define JZ4740_IRQ_GPIO2	26
#define JZ4740_IRQ_GPIO1	27
#define JZ4740_IRQ_GPIO0	28
#define JZ4740_IRQ_IPU		29
#define JZ4740_IRQ_LCD		30
/* 2nd-level interrupts */
#define JZ4740_IRQ_DMA_0	32  /* 32 to 37 for DMAC channel 0 to 5 */
#define JZ4740_IRQ_GPIO_0	48  /* 48 to 175 for GPIO pin 0 to 127 */


#define MSC_STAT_END_CMD_RES		(1 << 11)
#define MSC_STAT_DATA_FIFO_AFULL	(1 << 10)
#define MSC_STAT_IS_READWAIT		(1 << 9)
#define MSC_STAT_CLK_EN			(1 << 8)
#define MSC_STAT_DATA_FIFO_FULL		(1 << 7)
#define MSC_STAT_DATA_FIFO_EMPTY	(1 << 6)
#define MSC_STAT_CRC_RES_ERR		(1 << 5)
#define MSC_STAT_CRC_READ_ERROR		(1 << 4)
#define MSC_STAT_CRC_WRITE_ERROR_BIT	2
#define MSC_STAT_CRC_WRITE_ERROR_MASK	(0x3 << MSC_STAT_CRC_WRITE_ERROR_BIT)
/* No error on transmission of data */
  #define MSC_STAT_CRC_WRITE_ERROR_NO	(0 << MSC_STAT_CRC_WRITE_ERROR_BIT)
/* Card observed erroneous transmission of data */
  #define MSC_STAT_CRC_WRITE_ERROR	(1 << MSC_STAT_CRC_WRITE_ERROR_BIT)
/* No CRC status is sent back */
  #define MSC_STAT_CRC_WRITE_ERROR_NOSTS (2 << MSC_STAT_CRC_WRITE_ERROR_BIT)
#define MSC_STAT_TIME_OUT_RES		(1 << 1)
#define MSC_STAT_TIME_OUT_READ		(1 << 0)

/* MSC Bus Clock Control Register (MSC_CLKRT) */
#define MSC_CLKRT_CLK_RATE_BIT		0
#define MSC_CLKRT_CLK_RATE_MASK		(0x7 << MSC_CLKRT_CLK_RATE_BIT)
  #define MSC_CLKRT_CLK_RATE_DIV_1  (0x0 << MSC_CLKRT_CLK_RATE_BIT)
  #define MSC_CLKRT_CLK_RATE_DIV_2  (0x1 << MSC_CLKRT_CLK_RATE_BIT)
  #define MSC_CLKRT_CLK_RATE_DIV_4  (0x2 << MSC_CLKRT_CLK_RATE_BIT)
  #define MSC_CLKRT_CLK_RATE_DIV_8  (0x3 << MSC_CLKRT_CLK_RATE_BIT)
  #define MSC_CLKRT_CLK_RATE_DIV_16  (0x4 << MSC_CLKRT_CLK_RATE_BIT)
  #define MSC_CLKRT_CLK_RATE_DIV_32  (0x5 << MSC_CLKRT_CLK_RATE_BIT)
  #define MSC_CLKRT_CLK_RATE_DIV_64  (0x6 << MSC_CLKRT_CLK_RATE_BIT)
  #define MSC_CLKRT_CLK_RATE_DIV_128 (0x7 << MSC_CLKRT_CLK_RATE_BIT)

/* MSC Command Sequence Control Register (MSC_CMDAT) */
#define MSC_CMDAT_IO_ABORT	(1 << 11)
#define MSC_CMDAT_BUS_WIDTH_BIT	9
#define MSC_CMDAT_BUS_WIDTH_MASK (0x3 << MSC_CMDAT_BUS_WIDTH_BIT)
#define MSC_CMDAT_BUS_WIDTH_1BIT (0x0 << MSC_CMDAT_BUS_WIDTH_BIT)
#define MSC_CMDAT_BUS_WIDTH_4BIT (0x2 << MSC_CMDAT_BUS_WIDTH_BIT)
#define MSC_CMDAT_DMA_EN	(1 << 8)
#define MSC_CMDAT_INIT		(1 << 7)
#define MSC_CMDAT_BUSY		(1 << 6)
#define MSC_CMDAT_STREAM_BLOCK	(1 << 5)
#define MSC_CMDAT_WRITE		(1 << 4)
#define MSC_CMDAT_READ		(0 << 4)
#define MSC_CMDAT_DATA_EN	(1 << 3)
#define MSC_CMDAT_RESPONSE_BIT	0
#define MSC_CMDAT_RESPONSE_MASK	(0x7 << MSC_CMDAT_RESPONSE_BIT)
#define MSC_CMDAT_RESPONSE_NONE	(0x0 << MSC_CMDAT_RESPONSE_BIT)
#define MSC_CMDAT_RESPONSE_R1	(0x1 << MSC_CMDAT_RESPONSE_BIT)
#define MSC_CMDAT_RESPONSE_R2	(0x2 << MSC_CMDAT_RESPONSE_BIT)
#define MSC_CMDAT_RESPONSE_R3	(0x3 << MSC_CMDAT_RESPONSE_BIT)
#define MSC_CMDAT_RESPONSE_R4	(0x4 << MSC_CMDAT_RESPONSE_BIT)
#define MSC_CMDAT_RESPONSE_R5	(0x5 << MSC_CMDAT_RESPONSE_BIT)
#define MSC_CMDAT_RESPONSE_R6	(0x6 << MSC_CMDAT_RESPONSE_BIT)

/* MSC Interrupts Mask Register (MSC_IMASK) */
#define MSC_IMASK_SDIO			(1 << 7)
#define MSC_IMASK_TXFIFO_WR_REQ		(1 << 6)
#define MSC_IMASK_RXFIFO_RD_REQ		(1 << 5)
#define MSC_IMASK_END_CMD_RES		(1 << 2)
#define MSC_IMASK_PRG_DONE		(1 << 1)
#define MSC_IMASK_DATA_TRAN_DONE	(1 << 0)

#ifndef __ASSEMBLY__
/* INTC (Interrupt Controller) */
struct jz4740_intc {
	uint32_t isr;		/* interrupt source register */
	uint32_t imr;		/* interrupt mask register */
	uint32_t imsr;		/* interrupt mask set register */
	uint32_t imcr;		/* interrupt mask clear register */
	uint32_t ipr;		/* interrupt pending register */
};

/* RTC */
struct jz4740_rtc {
	uint32_t rcr;		/* rtc control register */
	uint32_t rsr;		/* rtc second register */
	uint32_t rsar;		/* rtc second alarm register */
	uint32_t rgr;		/* rtc regulator register */
	uint32_t hcr;		/* hibernate control register */
	uint32_t hwfcr;		/* hibernate wakeup filter counter reg */
	uint32_t hrcr;		/* hibernate reset counter reg */
	uint32_t hwcr;		/* hibernate wakeup control register */
	uint32_t hwrsr;		/* hibernate wakeup status reg */
	uint32_t hspr;		/* scratch pattern register */
};

/* CPM (Clock reset and Power control Management) */
struct jz4740_cpm {
	uint32_t cpccr; /* 0x00 clock control reg */
	uint32_t lcr;	/* 0x04 low power control reg */
	uint32_t rsr;	/* 0x08 reset status reg */
	uint32_t pad00;
	uint32_t cppcr; /* 0x10 pll control reg */
	uint32_t pad01[3];
	uint32_t clkgr;	/* 0x20 clock gate reg */
	uint32_t scr;	/* 0x24 sleep control reg */
	uint32_t pad02[14];
	uint32_t i2scd; /* 0x60 I2S device clock divider reg */
	uint32_t lpcdr; /* 0x64 LCD pix clock divider reg */
	uint32_t msccdr; /* 0x68 MSC device clock divider reg */
	uint32_t uhccdr; /* 0x6C UHC 48M clock divider reg */
	uint32_t uhcts; /* 0x70 UHC PHY test point reg */
	uint32_t ssicd; /* 0x74 SSI clock divider reg */
};

/* TCU (Timer Counter Unit) */
struct jz4740_tcu {
	uint32_t pad00[4];
	uint32_t ter;	/* 0x10  Timer Counter Enable Register */
	uint32_t tesr;	/* 0x14  Timer Counter Enable Set Register */
	uint32_t tecr;	/* 0x18  Timer Counter Enable Clear Register */
	uint32_t tsr;	/* 0x1C  Timer Stop Register */
	uint32_t tfr;	/* 0x20  Timer Flag Register */
	uint32_t tfsr;	/* 0x24  Timer Flag Set Register */
	uint32_t tfcr;	/* 0x28  Timer Flag Clear Register */
	uint32_t tssr;	/* 0x2C  Timer Stop Set Register */
	uint32_t tmr;	/* 0x30  Timer Mask Register */
	uint32_t tmsr;	/* 0x34  Timer Mask Set Register */
	uint32_t tmcr;	/* 0x38  Timer Mask Clear Register */
	uint32_t tscr;	/* 0x3C  Timer Stop Clear Register */
	uint32_t tdfr0;	/* 0x40  Timer Data Full Register */
	uint32_t tdhr0;	/* 0x44  Timer Data Half Register */
	uint32_t tcnt0;	/* 0x48  Timer Counter Register */
	uint32_t tcsr0;	/* 0x4C  Timer Control Register */
	uint32_t tdfr1;	/* 0x50 */
	uint32_t tdhr1;	/* 0x54 */
	uint32_t tcnt1;	/* 0x58 */
	uint32_t tcsr1;	/* 0x5C */
	uint32_t tdfr2;	/* 0x60 */
	uint32_t tdhr2;	/* 0x64 */
	uint32_t tcnt2;	/* 0x68 */
	uint32_t tcsr2;	/* 0x6C */
	uint32_t tdfr3;	/* 0x70 */
	uint32_t tdhr3;	/* 0x74 */
	uint32_t tcnt3;	/* 0x78 */
	uint32_t tcsr3;	/* 0x7C */
	uint32_t tdfr4;	/* 0x80 */
	uint32_t tdhr4;	/* 0x84 */
	uint32_t tcnt4;	/* 0x88 */
	uint32_t tcsr4;	/* 0x8C */
	uint32_t tdfr5;	/* 0x90 */
	uint32_t tdhr5;	/* 0x94 */
	uint32_t tcnt5;	/* 0x98 */
	uint32_t tcsr5;	/* 0x9C */
};

/* WDT (WatchDog Timer) */
struct jz4740_wdt {
	uint16_t tdr; /* 0x00 watchdog timer data reg*/
	uint16_t pad00;
	uint8_t tcer; /* 0x04 watchdog counter enable reg*/
	uint8_t pad01[3];
	uint16_t tcnt; /* 0x08 watchdog timer counter*/
	uint16_t pad02;
	uint16_t tcsr; /* 0x0C watchdog timer control reg*/
	uint16_t pad03;
};

struct jz4740_uart {
	uint8_t rbr_thr_dllr;
		/* 0x00 R  8b receive buffer reg */
		/* 0x00 W  8b transmit hold reg */
		/* 0x00 RW 8b divisor latch low reg */
	uint8_t pad00[3];
	uint8_t dlhr_ier;
		/* 0x04 RW 8b divisor latch high reg */
		/* 0x04 RW 8b interrupt enable reg */
	uint8_t pad01[3];
	uint8_t iir_fcr;
		/* 0x08 R  8b interrupt identification reg */
		/* 0x08 W  8b FIFO control reg */
	uint8_t pad02[3];
	uint8_t lcr;	/* 0x0C RW 8b Line control reg */
	uint8_t pad03[3];
	uint8_t mcr;	/* 0x10 RW 8b modem control reg */
	uint8_t pad04[3];
	uint8_t lsr;	/* 0x14 R  8b line status reg */
	uint8_t pad05[3];
	uint8_t msr;	/* 0x18 R  8b modem status reg */
	uint8_t pad06[3];
	uint8_t spr;	/* 0x1C RW 8b scratch pad reg */
	uint8_t pad07[3];
	uint8_t isr;	/* 0x20 RW 8b infrared selection reg */
	uint8_t pad08[3];
	uint8_t umr;	/* 0x24 RW 8b */
};

/* MSC */
struct jz4740_msc {
	uint16_t strpcl;/* 0x00 */
	uint32_t stat;	/* 0x04 */
	uint16_t clkrt;	/* 0x08 */
	uint32_t cmdat;	/* 0x0C */
	uint16_t resto;	/* 0x10 */
	uint16_t rdto;	/* 0x14 */
	uint16_t blklen;/* 0x18 */
	uint16_t nob;	/* 0x1C */
	uint16_t snob;	/* 0x20 */
	uint16_t imask;	/* 0x24 */
	uint16_t ireg;	/* 0x28 */
	uint8_t  cmd;	/* 0x2C */
	uint32_t arg;	/* 0x30 */
	uint16_t res;	/* 0x34 */
	uint32_t rxfifo;/* 0x38 */
	uint32_t txfifo;/* 0x3C */
};

/* External Memory Controller */
struct jz4740_emc {
	uint32_t bcr; /* 0x00 BCR */
	uint32_t pad00[3];
	uint32_t smcr[5];
		/* x10 Static Memory Control Register 0 */
		/* x14 Static Memory Control Register 1 */
		/* x18 Static Memory Control Register 2 */
		/* x1c Static Memory Control Register 3 */
		/* x20 Static Memory Control Register 4 */
	uint32_t pad01[3];
	uint32_t sacr[5];
		/* x30 Static Memory Bank 0 Addr Config Reg */
		/* x34 Static Memory Bank 1 Addr Config Reg */
		/* x38 Static Memory Bank 2 Addr Config Reg */
		/* x3c Static Memory Bank 3 Addr Config Reg */
		/* x40 Static Memory Bank 4 Addr Config Reg */
	uint32_t pad02[3];
	uint32_t nfcsr; /* x050 NAND Flash Control/Status Register */

	uint32_t pad03[11];
	uint32_t dmcr; /* x80 DRAM Control Register */
	uint16_t rtcsr; /* x84 Refresh Time Control/Status Register */
	uint16_t pad04;
	uint16_t rtcnt; /* x88 Refresh Timer Counter */
	uint16_t pad05;
	uint16_t rtcor; /* x8c Refresh Time Constant Register */
	uint16_t pad06;
