/*
 * (C) Copyright 2011 - 2013 Xilinx
 *
 * Xilinx PS Quad-SPI (QSPI) controller driver (master mode only)
 *
 * This program is free software; you can redistribute it and/or modify it under
 * the terms of the GNU General Public License version 2 as published by the
 * Free Software Foundation; either version 2 of the License, or (at your
 * option) any later version.
 *
 * You should have received a copy of the GNU General Public License along with
 * this program; if not, write to the Free Software Foundation, Inc., 59 Temple
 * Place, Suite 330, Boston, MA 02111-1307 USA
 */

#include <common.h>
#include <malloc.h>
#include <ubi_uboot.h>
#include <spi.h>
#include <asm/io.h>
#include <asm/arch/hardware.h>
#include <asm/arch/sys_proto.h>

/* QSPI Transmit Data Register */
#define XQSPIPS_TXD_00_00_OFFSET	0x1C /* Transmit 4-byte inst, WO */
#define XQSPIPS_TXD_00_01_OFFSET	0x80 /* Transmit 1-byte inst, WO */
#define XQSPIPS_TXD_00_10_OFFSET	0x84 /* Transmit 2-byte inst, WO */
#define XQSPIPS_TXD_00_11_OFFSET	0x88 /* Transmit 3-byte inst, WO */

/*
 * QSPI Configuration Register bit Masks
 *
 * This register contains various control bits that effect the operation
 * of the QSPI controller
 */
#define XQSPIPS_CONFIG_MANSRT_MASK	0x00010000 /* Manual TX Start */
#define XQSPIPS_CONFIG_CPHA_MASK	0x00000004 /* Clock Phase Control */
#define XQSPIPS_CONFIG_CPOL_MASK	0x00000002 /* Clock Polarity Control */
#define XQSPIPS_CONFIG_SSCTRL_MASK	0x00003C00 /* Slave Select Mask */

/*

#define XQSPIPS_IXR_ALL_MASK		(XQSPIPS_IXR_TXNFULL_MASK | \
					XQSPIPS_IXR_RXNEMTY_MASK)

/*
 * QSPI Enable Register bit Masks
 *
 * This register is used to enable or disable the QSPI controller
 */
#define XQSPIPS_ENABLE_ENABLE_MASK	0x00000001 /* QSPI Enable Bit Mask */

/*
 * QSPI Linear Configuration Register
 *
 * It is named Linear Configuration but it controls other modes when not in
 * linear mode also.
 */
#define XQSPIPS_LCFG_TWO_MEM_MASK	0x40000000 /* QSPI Enable Bit Mask */
#define XQSPIPS_LCFG_SEP_BUS_MASK	0x20000000 /* QSPI Enable Bit Mask */
#define XQSPIPS_LCFG_U_PAGE		0x10000000 /* QSPI Upper memory set */

#define XQSPIPS_LCFG_DUMMY_SHIFT	8

#define XQSPIPS_FAST_READ_QOUT_CODE	0x6B	/* read instruction code */

/*
 * The modebits configurable by the driver to make the SPI support different
 * data formats
 */
#define MODEBITS			(SPI_CPOL | SPI_CPHA)

/* Definitions for the status of queue */
#define XQSPIPS_QUEUE_STOPPED		0
#define XQSPIPS_QUEUE_RUNNING		1

/* QSPI MIO's count for different connection topologies */
#define XQSPIPS_MIO_NUM_QSPI0		6
#define XQSPIPS_MIO_NUM_QSPI1		5
#define XQSPIPS_MIO_NUM_QSPI1_CS	1

/* QSPI connections topology */
enum xqspips_con_topology {
	MODE_UNKNOWN = -1,
	MODE_SINGLE,
	MODE_DUAL_STACKED,
	MODE_DUAL_PARALLEL,
};

/* Definitions of the flash commands - Flash opcodes in ascending order */
#define XQSPIPS_FLASH_OPCODE_WRSR	0x01	/* Write status register */
#define XQSPIPS_FLASH_OPCODE_PP		0x02	/* Page program */
#define XQSPIPS_FLASH_OPCODE_NORM_READ	0x03	/* Normal read data bytes */
#define XQSPIPS_FLASH_OPCODE_WRDS	0x04	/* Write disable */
#define XQSPIPS_FLASH_OPCODE_RDSR1	0x05	/* Read status register 1 */
#define XQSPIPS_FLASH_OPCODE_WREN	0x06	/* Write enable */
#define XQSPIPS_FLASH_OPCODE_FAST_READ	0x0B	/* Fast read data bytes */
#define XQSPIPS_FLASH_OPCODE_BRRD	0x16	/* Bank address reg read */
#define XQSPIPS_FLASH_OPCODE_BRWR	0x17	/* Bank address reg write */
#define XQSPIPS_FLASH_OPCODE_BE_4K	0x20	/* Erase 4KiB block */
#define XQSPIPS_FLASH_OPCODE_RDSR2	0x35	/* Read status register 2 */
#define XQSPIPS_FLASH_OPCODE_DUAL_READ	0x3B	/* Dual read data bytes */
#define XQSPIPS_FLASH_OPCODE_BE_32K	0x52	/* Erase 32KiB block */
#define XQSPIPS_FLASH_OPCODE_QUAD_READ	0x6B	/* Quad read data bytes */
#define XQSPIPS_FLASH_OPCODE_ERASE_SUS	0x75	/* Erase suspend */
#define XQSPIPS_FLASH_OPCODE_ERASE_RES	0x7A	/* Erase resume */
#define XQSPIPS_FLASH_OPCODE_RDID	0x9F	/* Read JEDEC ID */
#define XQSPIPS_FLASH_OPCODE_WREAR	0xC5	/* Extended address reg write */
#define XQSPIPS_FLASH_OPCODE_RDEAR	0xC8	/* Extended address reg read */
#define XQSPIPS_FLASH_OPCODE_BE		0xC7	/* Erase whole flash block */
#define XQSPIPS_FLASH_OPCODE_SE		0xD8	/* Sector erase (usually 64KB)*/

/* Few mtd flash functions */
extern int spi_flash_cmd(struct spi_slave *spi, u8 cmd,
		void *response, size_t len);
extern int spi_flash_cmd_read(struct spi_slave *spi, const u8 *cmd,
		size_t cmd_len, void *data, size_t data_len);

/* QSPI register offsets */
struct xqspips_regs {
	u32 confr;	/* 0x00 */
	u32 isr;	/* 0x04 */
	u32 ier;	/* 0x08 */
	u32 idisr;	/* 0x0C */
	u32 imaskr;	/* 0x10 */
	u32 enbr;	/* 0x14 */
	u32 dr;		/* 0x18 */
	u32 txd0r;	/* 0x1C */
	u32 drxr;	/* 0x20 */
	u32 sicr;	/* 0x24 */
	u32 txftr;	/* 0x28 */
	u32 rxftr;	/* 0x2C */
	u32 gpior;	/* 0x30 */
	u32 reserved0[19];
	u32 txd1r;	/* 0x80 */
	u32 txd2r;	/* 0x84 */
	u32 txd3r;	/* 0x88 */
	u32 reserved1[5];
	u32 lcr;	/* 0xA0 */
	u32 reserved2[22];
	u32 midr;	/* 0xFC */
};

#define xqspips_base ((struct xqspips_regs *)ZYNQ_QSPI_BASEADDR)

struct xqspips {
	u32 input_clk_hz;
	u32 speed_hz;
	const void *txbuf;
	void *rxbuf;
	int bytes_to_transfer;
	int bytes_to_receive;
	struct xqspips_inst_format *curr_inst;
	u8 inst_response;
	unsigned int is_inst;
	unsigned int is_dual;
	unsigned int u_page;
};

struct spi_device {
	struct xqspips master;
	u32 max_speed_hz;
	u8 chip_select;
	u8 mode;
	u8 bits_per_word;
};

struct spi_transfer {
	const void *tx_buf;
	void *rx_buf;
	unsigned len;
	unsigned cs_change:1;
	u8 bits_per_word;
	u16 delay_usecs;
	u32 speed_hz;
};

struct zynq_spi_slave {
	struct spi_slave slave;
	struct spi_device qspi;
};
#define to_zynq_spi_slave(s) container_of(s, struct zynq_spi_slave, slave)

/*
 * struct xqspips_inst_format - Defines qspi flash instruction format
 * @opcode:		Operational code of instruction
 * @inst_size:		Size of the instruction including address bytes
